"""
Python 里的运算符和其它编程语言里的运算符基本一样

1、算数运算符
+     加法
-     减法
*     乘法
/     除法
//    整除
%     取余

2、赋值运算符
a = 10
a += 5  # 等价于 a = a + 5
a -= 5  # 等价于 a = a - 5
a *= 5  # 等价于 a = a * 5
a /= 5  # 等价于 a = a / 5
a //= 5 # 等价于 a = a // 5
a %= 5  # 等价于 a = a % 5

3、比较运算符
==    等于
!=    不等于
>     大于
<     小于
>=    大于等于
<=    小于等于

4、逻辑运算符
and    逻辑与，两个条件都为 True，结果才是 True
or     逻辑或，只要有一个条件为 True，结果就是 True
not    逻辑非，取反

5、三目运算符
Java 里【条件 ? 值1 : 值2】，例如 max = a > b ? a : b
Python 里【值1 if 条件 else 值2】，例如 max = a if a > b else b
"""
